{
  "id": 363088,
  "page": 1,
  "results": [
    {
      "author": "Gimly",
      "content": "It's fun to see big stuff get real little and little stuff get real big, but _Ant-Man and the Wasp_ suffers the same problems of its predecessor, except this time with an added issue, one that effects many movies (and even more TV shows), the problem of \"The entire movie didn't have to happen if people would just have had normal human conversations with one another\".\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._",
      "id": "5b99caa7c3a368278b0006a6",
      "url": "https://www.themoviedb.org/review/5b99caa7c3a368278b0006a6"
    },
    {
      "author": "John Smith",
      "content": "Actually quite good! It's like a less-weird, but more fun version of a Deadpool - in the sense that it is both filled with action but also with fun acting.\r\n\r\nI recommend it for a Saturday evening. It is quite wholesome.",
      "id": "5bc243310e0a266e6b035e11",
      "url": "https://www.themoviedb.org/review/5bc243310e0a266e6b035e11"
    },
    {
      "author": "Per Gunnar Jonsson",
      "content": "I did indeed enjoy this movie…somewhat. However I cannot say that I was overly impressed.\r\n\r\nThe story was okay. I would not expect a deep and thought provoking story from a super hero movie nor would I want it. It served as a decent enough vehicle for moving things forward.\r\n\r\nMost of the actors did a good enough job of the role they were given which in some cases was pretty much mission impossible given some of the overly silly characters in the movie. In particular I got tired of Luis almost before the first scenes he was in had finished. He was just so silly that you started to wonder what age the target audience was. Jimmy Woo was not far behind.\r\n\r\nI think this leads to my main gripe with the movie. I expected a super hero movie but what I got was a fairly lame comedy with super heroes in it. It was just too much comic elements in it for me. I could probably have liked it if the jokes were somewhat intelligent but, for me, they were not. They alternated between overly silly and stupid characters, slap-stick and simple fall-on-your ass jokes.\r\n\r\nWhat about the bad guy? Well, first off, there was not really a distinct bad guy but a hole bunch of them. Unfortunately none of them had any real bad guy charisma. I assume that Sonny was supposed to be the main bad guy and he certainly had enough evil lunatic air about him to fit that but again…too silly. Then we have the lame Jimmy Woo who was just annoying. The Ghost was probably the best one but then she was not really a bad guy was she?\r\n\r\nI did like most of the action and the special effects though. The playing around with shrinking and returning to normal size, or greater, was both cool and funny. This shrinking business is of course a difficult theme to work with from a science and logic point of view. For instance, if you shrink a car to the size of a toy car it still weighs like a full size one and you cannot just pick it up. And what about the lab popping up and down all the time? Why weren’t everything shaken to bits inside when they started to run around with it? And don’t get me started about electricity and plumbing. But then, in this kind of movie I would say just just have to turn off that part of your brain. It made for some cool scenes after all.\r\n\r\nI also did like that the story was more of a down to Earth story. No overall galactic plot, no snapping of fingers to make…well you know what. Okay, there was the post credit scenes which was a bit of an annoying tie in. Perhaps best of all though, I could not really feel much SJW or other form of politically correct preaching being showed down my throat. Today that is a great plus for any movie.\r\n\r\nSo, to sum up, I did enjoy it but it was not great and I was indeed a little bit disappointed at the end.",
      "id": "5bfa580592514104cc022459",
      "url": "https://www.themoviedb.org/review/5bfa580592514104cc022459"
    }
  ],
  "total_pages": 1,
  "total_results": 3
}